URL/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("url_id", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url_id", 1], ["submitter_id", 1], ["created_at", "2021-01-28 22:07:33.973173"], ["updated_at", "2021-01-28 22:07:33.973173"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(url_id: shortened_url.id, submitter_id: user.id)